package sample.model;

public class ListConstant {
    public final static int[][] board = new int[][] { // 0 - черная клетка, 1 - белая клетка
            {1,0,1,0,1,0,1,0},
            {0,1,0,1,0,1,0,1},
            {1,0,1,0,1,0,1,0},
            {0,1,0,1,0,1,0,1},
            {1,0,1,0,1,0,1,0},
            {0,1,0,1,0,1,0,1},
            {1,0,1,0,1,0,1,0},
            {0,1,0,1,0,1,0,1},
    };
    public static int[][] checkers = new int[][] { // 1 - шашка первого игрока (снизу), -1 - шашка второго игрока (сверху)
            {0,-1,0,-1,0,-1,0,-1},
            {-1,0,-1,0,-1,0,-1,0},
            {0,-1,0,-1,0,-1,0,-1},
            {0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0},
            {1,0,1,0,1,0,1,0},
            {0,1,0,1,0,1,0,1},
            {1,0,1,0,1,0,1,0},
    };
    public static boolean firstPlayerMove = true, impactCheck = false;; // ход какого игрока, и может ли шашка побить другую
    public static int saveY, saveX, coordX, coordY; // координаты прошлого нажатия и координаты нового нажатия мыши

}
